Tekla Open API Reference for Tekla Structures 2025
IntList.ToArray Method
 Copies the integers to an integer array.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int[] ToArray()
Public Function ToArray As Integer()
Return Value
Type: Int32[]
The array of integers.
See Also
Reference
IntList Class
Tekla.Structures.Drawing Namespace